scripts/exp2/redis-sls-400-02.txt
====== PING_INLINE ======
  100000 requests completed in 2.78 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 0.3 milliseconds
0.00% <= 0.4 milliseconds
0.11% <= 0.5 milliseconds
4.43% <= 0.6 milliseconds
39.58% <= 0.7 milliseconds
84.82% <= 0.8 milliseconds
97.43% <= 0.9 milliseconds
98.69% <= 1.0 milliseconds
98.87% <= 1.1 milliseconds
98.95% <= 1.2 milliseconds
99.00% <= 1.3 milliseconds
99.03% <= 1.4 milliseconds
99.07% <= 1.5 milliseconds
99.12% <= 1.6 milliseconds
99.16% <= 1.7 milliseconds
99.20% <= 1.8 milliseconds
99.23% <= 1.9 milliseconds
99.25% <= 2.0 milliseconds
99.26% <= 2 milliseconds
99.55% <= 3 milliseconds
99.64% <= 4 milliseconds
99.65% <= 5 milliseconds
99.65% <= 6 milliseconds
99.68% <= 7 milliseconds
99.70% <= 11 milliseconds
99.77% <= 12 milliseconds
99.84% <= 13 milliseconds
99.85% <= 21 milliseconds
99.89% <= 22 milliseconds
99.99% <= 23 milliseconds
100.00% <= 23 milliseconds
35958.29 requests per second

====== PING_BULK ======
  100000 requests completed in 2.73 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.16% <= 1 milliseconds
99.53% <= 2 milliseconds
99.65% <= 11 milliseconds
99.78% <= 12 milliseconds
99.83% <= 13 milliseconds
99.90% <= 15 milliseconds
99.95% <= 16 milliseconds
99.95% <= 21 milliseconds
99.99% <= 22 milliseconds
100.00% <= 22 milliseconds
36589.83 requests per second

====== SET ======
  100000 requests completed in 2.78 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.06% <= 1 milliseconds
99.52% <= 2 milliseconds
99.65% <= 3 milliseconds
99.65% <= 10 milliseconds
99.70% <= 11 milliseconds
99.79% <= 12 milliseconds
99.80% <= 14 milliseconds
99.83% <= 15 milliseconds
99.85% <= 21 milliseconds
99.94% <= 22 milliseconds
100.00% <= 22 milliseconds
35984.17 requests per second

====== GET ======
  100000 requests completed in 2.72 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.20% <= 1 milliseconds
99.53% <= 2 milliseconds
99.67% <= 3 milliseconds
99.70% <= 4 milliseconds
99.73% <= 5 milliseconds
99.75% <= 11 milliseconds
99.81% <= 12 milliseconds
99.85% <= 14 milliseconds
99.87% <= 15 milliseconds
99.90% <= 21 milliseconds
99.96% <= 22 milliseconds
100.00% <= 22 milliseconds
36737.70 requests per second

====== INCR ======
  100000 requests completed in 2.71 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.09% <= 1 milliseconds
99.49% <= 2 milliseconds
99.67% <= 3 milliseconds
99.73% <= 4 milliseconds
99.74% <= 5 milliseconds
99.75% <= 6 milliseconds
99.75% <= 11 milliseconds
99.87% <= 12 milliseconds
99.95% <= 14 milliseconds
99.98% <= 15 milliseconds
100.00% <= 15 milliseconds
36913.99 requests per second

====== LPUSH ======
  100000 requests completed in 2.71 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.93% <= 1 milliseconds
99.47% <= 2 milliseconds
99.65% <= 6 milliseconds
99.70% <= 7 milliseconds
99.70% <= 11 milliseconds
99.79% <= 12 milliseconds
99.90% <= 16 milliseconds
99.93% <= 17 milliseconds
99.95% <= 22 milliseconds
99.98% <= 23 milliseconds
100.00% <= 23 milliseconds
36845.98 requests per second

====== RPUSH ======
  100000 requests completed in 2.73 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.90% <= 1 milliseconds
99.44% <= 2 milliseconds
99.73% <= 3 milliseconds
99.75% <= 6 milliseconds
99.80% <= 7 milliseconds
99.80% <= 11 milliseconds
99.82% <= 12 milliseconds
99.85% <= 16 milliseconds
99.87% <= 17 milliseconds
99.90% <= 21 milliseconds
99.91% <= 22 milliseconds
100.00% <= 22 milliseconds
36656.89 requests per second

====== LPOP ======
  100000 requests completed in 2.73 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.74% <= 1 milliseconds
99.27% <= 2 milliseconds
99.61% <= 3 milliseconds
99.70% <= 4 milliseconds
99.70% <= 5 milliseconds
99.72% <= 6 milliseconds
99.75% <= 9 milliseconds
99.77% <= 10 milliseconds
99.80% <= 11 milliseconds
99.85% <= 12 milliseconds
99.90% <= 15 milliseconds
99.95% <= 16 milliseconds
99.95% <= 17 milliseconds
99.97% <= 18 milliseconds
100.00% <= 18 milliseconds
36603.22 requests per second

====== RPOP ======
  100000 requests completed in 2.75 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.75% <= 1 milliseconds
99.38% <= 2 milliseconds
99.65% <= 3 milliseconds
99.70% <= 4 milliseconds
99.73% <= 5 milliseconds
99.75% <= 11 milliseconds
99.78% <= 12 milliseconds
99.85% <= 17 milliseconds
99.88% <= 18 milliseconds
99.95% <= 19 milliseconds
99.95% <= 21 milliseconds
99.97% <= 22 milliseconds
100.00% <= 22 milliseconds
36403.35 requests per second

====== SADD ======
  100000 requests completed in 2.77 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.76% <= 1 milliseconds
99.36% <= 2 milliseconds
99.60% <= 3 milliseconds
99.63% <= 4 milliseconds
99.65% <= 5 milliseconds
99.65% <= 6 milliseconds
99.74% <= 7 milliseconds
99.75% <= 11 milliseconds
99.80% <= 12 milliseconds
99.80% <= 21 milliseconds
99.91% <= 22 milliseconds
100.00% <= 22 milliseconds
36114.12 requests per second

====== HSET ======
  100000 requests completed in 2.70 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.01% <= 1 milliseconds
99.50% <= 2 milliseconds
99.70% <= 3 milliseconds
99.73% <= 4 milliseconds
99.75% <= 5 milliseconds
99.80% <= 6 milliseconds
99.80% <= 11 milliseconds
99.85% <= 12 milliseconds
99.95% <= 21 milliseconds
99.99% <= 22 milliseconds
100.00% <= 22 milliseconds
37037.04 requests per second

====== SPOP ======
  100000 requests completed in 2.81 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

97.65% <= 1 milliseconds
99.34% <= 2 milliseconds
99.60% <= 3 milliseconds
99.70% <= 4 milliseconds
99.72% <= 5 milliseconds
99.79% <= 6 milliseconds
99.80% <= 9 milliseconds
99.82% <= 10 milliseconds
99.85% <= 12 milliseconds
99.86% <= 13 milliseconds
99.92% <= 14 milliseconds
99.95% <= 21 milliseconds
99.97% <= 22 milliseconds
100.00% <= 22 milliseconds
35637.92 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  100000 requests completed in 2.72 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.95% <= 1 milliseconds
99.45% <= 2 milliseconds
99.73% <= 3 milliseconds
99.75% <= 11 milliseconds
99.79% <= 12 milliseconds
99.80% <= 13 milliseconds
99.81% <= 14 milliseconds
99.85% <= 16 milliseconds
99.88% <= 17 milliseconds
99.91% <= 18 milliseconds
99.95% <= 22 milliseconds
100.00% <= 23 milliseconds
36818.85 requests per second

====== LRANGE_100 (first 100 elements) ======
  100000 requests completed in 3.35 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

93.53% <= 1 milliseconds
99.19% <= 2 milliseconds
99.45% <= 3 milliseconds
99.59% <= 4 milliseconds
99.63% <= 5 milliseconds
99.67% <= 6 milliseconds
99.70% <= 7 milliseconds
99.74% <= 8 milliseconds
99.75% <= 11 milliseconds
99.84% <= 12 milliseconds
99.95% <= 13 milliseconds
99.95% <= 18 milliseconds
99.96% <= 19 milliseconds
100.00% <= 19 milliseconds
29868.58 requests per second

====== LRANGE_300 (first 300 elements) ======
  100000 requests completed in 5.61 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
98.73% <= 2 milliseconds
99.00% <= 3 milliseconds
99.26% <= 4 milliseconds
99.28% <= 5 milliseconds
99.30% <= 6 milliseconds
99.30% <= 11 milliseconds
99.31% <= 12 milliseconds
99.40% <= 13 milliseconds
99.49% <= 14 milliseconds
99.57% <= 15 milliseconds
99.59% <= 16 milliseconds
99.60% <= 17 milliseconds
99.62% <= 18 milliseconds
99.64% <= 19 milliseconds
99.65% <= 21 milliseconds
99.69% <= 22 milliseconds
99.84% <= 23 milliseconds
99.95% <= 24 milliseconds
100.00% <= 24 milliseconds
17831.67 requests per second

====== LRANGE_500 (first 450 elements) ======
  100000 requests completed in 7.06 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
98.24% <= 2 milliseconds
99.15% <= 3 milliseconds
99.38% <= 4 milliseconds
99.48% <= 5 milliseconds
99.53% <= 6 milliseconds
99.59% <= 7 milliseconds
99.64% <= 8 milliseconds
99.68% <= 9 milliseconds
99.69% <= 10 milliseconds
99.71% <= 11 milliseconds
99.72% <= 12 milliseconds
99.78% <= 13 milliseconds
99.83% <= 14 milliseconds
99.87% <= 15 milliseconds
99.90% <= 21 milliseconds
99.91% <= 22 milliseconds
99.93% <= 23 milliseconds
99.96% <= 24 milliseconds
99.98% <= 25 milliseconds
100.00% <= 26 milliseconds
100.00% <= 26 milliseconds
14160.29 requests per second

====== LRANGE_600 (first 600 elements) ======
  100000 requests completed in 8.00 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
58.13% <= 2 milliseconds
99.12% <= 3 milliseconds
99.92% <= 4 milliseconds
99.94% <= 5 milliseconds
99.98% <= 6 milliseconds
99.99% <= 7 milliseconds
100.00% <= 7 milliseconds
12503.13 requests per second

====== MSET (10 keys) ======
  100000 requests completed in 2.70 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.41% <= 1 milliseconds
99.89% <= 2 milliseconds
99.93% <= 3 milliseconds
99.97% <= 4 milliseconds
100.00% <= 4 milliseconds
37023.32 requests per second